app/Exports/OrdersExport.php

    public function generatePdf()
    {
        // Fetch data from the database
        $data = DB::table('orders')
            ->join('order_items', 'orders.id', '=', 'order_items.order_id')
            ->leftJoin('variation', 'order_items.variation_id', '=', 'variation.id') // Use LEFT JOIN instead of JOIN
            ->join('products', 'variation.product_id', '=', 'products.id')
            ->leftJoin('color', 'variation.color', '=', 'color.id') // Use leftJoin instead of join
            ->leftJoin('storage', 'variation.storage', '=', 'storage.id') // Use leftJoin instead of join
            ->join('grade', 'variation.grade', '=', 'grade.id')
            ->select(
                'orders.reference_id',
                'variation.sku',
                'order_items.quantity',
                'products.model',
                'color.name as color', // Access the storage column directly
                'storage.name as storage_name', // Access the storage column directly
                'grade.name as grade_name',
                // DB::raw('SUM(order_items.quantity) as total_quantity')
            )
            ->when(request('start_date') != '', function ($q) {
                return $q->where('orders.created_at', '>=', request('start_date', 0));
            })
            ->when(request('end_date') != '', function ($q) {
                return $q->where('orders.created_at', '<=', request('end_date', 0) . " 23:59:59");
            })
            ->when(request('status') != '', function ($q) {
                return $q->where('orders.status', request('status'));
            })
            ->when(request('order_id') != '', function ($q) {
                return $q->where('orders.reference_id', 'LIKE', request('order_id') . '%');
            })
            ->when(request('last_order') != '', function ($q) {
                return $q->where('orders.reference_id', '>', request('last_order'));
            })
            ->when(request('sku') != '', function ($q) {
---
select `orders`.`reference_id`, `variation`.`sku`, `order_items`.`quantity`, `products`.`model`, `color`.`name` as `color`, `storage`.`name` as `storage`, `grade`.`name` as `grade_name` from `orders` inner join `order_items` on `orders`.`id` = `order_items`.`order_id` inner join `variation` on `order_items`.`variation_id` = `variation`.`id` inner join `products` on `variation`.`product_id` = `products`.`id` inner join `color` on `variation`.`color` = `color`.`id` inner join `storage` on `variation`.`storage` = `storage`.`id` inner join `grade` on `variation`.`grade` = `grade`.`id` order by `orders`.`reference_id` desc