<?php

return [
    'language' => 'ภาษา',
    'invoice' => 'ใบแจ้งหนี้',
    'bill_to' => 'เรียกเก็บเงินถึง:',
    'order_id' => 'รหัสคำสั่งซื้อ:',
    'sales_rep' => 'พนักงานขาย:',
    'order_date' => 'วันที่สั่งซื้อ:',
    'invoice_date' => 'วันที่ออกใบแจ้งหนี้:',
    'order_items' => 'รายการสินค้า',
    'product_name' => 'ชื่อสินค้า',
    'price' => 'ราคา',
    'qty' => 'จำนวน',
    'total' => 'รวม',
    'accessories' => 'อุปกรณ์เสริม',
    'sub_total' => 'ยอดรวมย่อย:',
    'vat' => 'ภาษีมูลค่าเพิ่ม:',
    'amount_due' => 'ยอดชำระ:',
    'change' => 'เงินทอน:',
    'store_policy' => 'นโยบายร้านค้า',
    'vat_notice' => 'ขายตามระบบภาษีมูลค่าเพิ่มแบบมาร์จิ้น เลขประจำตัวผู้เสียภาษี: :vat',
];
