app/Http/Livewire/Index.php

select * from `products` where `products`.`deleted_at` is null order by `model` asc
select * from `color`
select * from `storage`
select * from `grade`
select `products`.`model` as `product_name`, `color`.`name` as `color`, `storage`.`name` as `storage`, `variation`.`sku` as `sku`, `grade`.`name` as `grade`, SUM(order_items.quantity) as total_quantity_sold, AVG(CASE WHEN orders.currency = 4 THEN order_items.price END) as average_price from `order_items` inner join `variation` on `order_items`.`variation_id` = `variation`.`id` inner join `orders` on `order_items`.`order_id` = `orders`.`id` inner join `products` on `variation`.`product_id` = `products`.`id` inner join `color` on `variation`.`color` = `color`.`id` inner join `storage` on `variation`.`storage` = `storage`.`id` inner join `grade` on `variation`.`grade` = `grade`.`id` where `order_items`.`created_at` >= '2024-04-17 00:00:00' and `order_items`.`created_at` <= '2024-04-17 23:59:59' and `orders`.`order_type_id` = 3 and `order_items`.`deleted_at` is null group by `order_items`.`variation_id`, `products`.`model`, `storage`.`name`, `color`.`name`, `variation`.`sku`, `grade`.`name` order by `total_quantity_sold` desc limit 10
select count(*) as aggregate from `orders` where `created_at` >= '2024-04-17 00:00:00' and `created_at` <= '2024-04-17 23:59:59' and `order_type_id` = 3 and `orders`.`deleted_at` is null
select count(*) as aggregate from `orders` where `created_at` >= '2024-04-17 00:00:00' and `created_at` <= '2024-04-17 23:59:59' and `order_type_id` = 3 and `status` < 3 and `orders`.`deleted_at` is null
select `grade`.`name` as `grade`, `variation`.`grade` as `grade_id`, COUNT(*) as quantity from `stock` inner join `variation` on `stock`.`variation_id` = `variation`.`id` inner join `grade` on `variation`.`grade` = `grade`.`id` where `stock`.`status` != 2 and `stock`.`deleted_at` is null group by `variation`.`grade`, `grade`.`name` order by `grade_id` asc
---
    public function render(Request $request)
    {
        // dd('Hello2');
        $user_id = session('user_id');

        if(request('per_page') != null){
            $per_page = request('per_page');
        }else{
            $per_page = 10;
        }

        $data['products'] = Products_model::orderBy('model','asc')->get();
        $data['colors'] = Color_model::all();
        $data['storages'] = Storage_model::all();
        $data['grades'] = Grade_model::all();
        $data['variations'] = Variation_model::where('product_id',null)
        ->orderBy('name','desc')
        ->paginate($per_page)
        ->onEachSide(5)
        ->appends(request()->except('page'));

        $start_date = Carbon::now()->startOfDay();
        $end_date = date('Y-m-d 23:59:59');
        if ($request->start != NULL && $request->end != NULL) {
            $start_date = $request->start . " 00:00:00";
            $end_date = $request->end . " 23:59:59";
        }
        // $products = Products_model::get()->toArray();
        // Retrieve the top 10 selling products from the order_items table
        $data['top_products'] = Order_item_model::select('products.model as product_name', 'color.name as color', 'storage.name as storage', 'variation.sku as sku', 'grade.name as grade', DB::raw('SUM(order_items.quantity) as total_quantity_sold'), DB::raw('AVG(CASE WHEN orders.currency = 4 THEN order_items.price END) as average_price'))
        ->where('order_items.created_at', '>=', $start_date)->where('order_items.created_at', '<=', $end_date)->where('orders.order_type_id',3)
        ->join('variation', 'order_items.variation_id', '=', 'variation.id')
        ->join('orders', 'order_items.order_id', '=', 'orders.id')
        ->join('products', 'variation.product_id', '=', 'products.id')
        ->join('color', 'variation.color', '=', 'color.id')
        ->join('storage', 'variation.storage', '=', 'storage.id')
        ->join('grade', 'variation.grade', '=', 'grade.id')
        ->groupBy('order_items.variation_id', 'products.model', 'storage.name', 'color.name', 'variation.sku', 'grade.name')
        ->orderByDesc('total_quantity_sold')
        ->take($per_page)
        ->get();

        $data['total_orders'] = Order_model::where('created_at', '>=', $start_date)->where('created_at', '<=', $end_date)->where('order_type_id',3)->count();
        $data['pending_orders'] = Order_model::where('created_at', '>=', $start_date)->where('created_at', '<=', $end_date)->where('order_type_id',3)->where('status','<',3)->count();
        $data['total_conversations'] = Order_item_model::where('created_at', '>=', $start_date)->where('created_at', '<=', $end_date)->where('care_id','!=',null)->count();

        $data['graded_inventory'] = Stock_model::select('grade.name as grade', 'variation.grade as grade_id', DB::raw('COUNT(*) as quantity'))
        ->where('stock.status', '!=', 2)
        ->join('variation', 'stock.variation_id', '=', 'variation.id')
        ->join('grade', 'variation.grade', '=', 'grade.id')
        ->groupBy('variation.grade', 'grade.name')
        ->orderBy('grade_id')
        ->get();