app/Http/Livewire/Order.php

select `id`, `code` from `currency`
---
    public function mount()
    {
        $this->currency_codes = Currency_model::pluck('id','code');

select * from `admin` where `id` != 1
select * from `grade` where `grade`.`id` in (2, 3)
select * from `variation` where `variation`.`id` in (551, 618, 816, 956, 1227, 1357, 1593, 1853) and `variation`.`deleted_at` is null and `variation`.`status` != 3
select * from `order_items` where `order_items`.`order_id` in (23281, 23282, 23283, 23285, 23286, 23287, 23288, 23289, 23290, 23291) and `order_items`.`deleted_at` is null
select * from `stock` where `stock`.`id` in (3286, 3297, 25179, 25180, 25181, 25182, 25183) and `stock`.`deleted_at` is null
---
    public function render()
    {

        $data['last_hour'] = Carbon::now()->subHour(1);
        $data['admins'] = Admin_model::where('id','!=',1)->get();
        $user_id = session('user_id');
        $data['pending_orders_count'] = Order_model::where('status',2)->count();
        $data['order_statuses'] = Order_status_model::get();
        if(request('per_page') != null){
            $per_page = request('per_page');
        }else{
            $per_page = 10;
        }
        // if(request('care')){
        //     foreach(Order_model::where('status',2)->pluck('reference_id') as $pend){
        //         $this->recheck($pend);
        //     }
        // }

        switch (request('sort')){
            case 2: $sort = "orders.reference_id"; $by = "ASC"; break;
            case 3: $sort = "products.model"; $by = "DESC"; break;
            case 4: $sort = "products.model"; $by = "ASC"; break;
            default: $sort = "orders.reference_id"; $by = "DESC";
        }
        $orders = Order_model::join('order_items', 'orders.id', '=', 'order_items.order_id')
        ->join('variation', 'order_items.variation_id', '=', 'variation.id')
        ->join('products', 'variation.product_id', '=', 'products.id')
        ->with(['order_items.variation', 'order_items.variation.grade_id', 'order_items.stock'])
        ->where('orders.order_type_id',3)
        ->when(request('start_date') != '', function ($q) {
            return $q->where('orders.created_at', '>=', request('start_date', 0));
        })
        ->when(request('end_date') != '', function ($q) {
            return $q->where('orders.created_at', '<=', request('end_date', 0) . " 23:59:59");
        })
        ->when(request('status') != '', function ($q) {
            return $q->where('orders.status', request('status'));
        })
        ->when(request('adm') != '', function ($q) {
            if(request('adm') == 0){
                return $q->where('orders.processed_by', null);
            }
            return $q->where('orders.processed_by', request('adm'));
        })
        ->when(request('care') != '', function ($q) {
            return $q->where('order_items.care_id', '!=', null);
        })
        ->when(request('order_id') != '', function ($q) {
            return $q->where('orders.reference_id', 'LIKE', request('order_id') . '%');
        })
        ->when(request('sku') != '', function ($q) {
            return $q->whereHas('order_items.variation', function ($q) {
                $q->where('sku', 'LIKE', '%' . request('sku') . '%');
            });
        })
        ->when(request('imei') != '', function ($q) {
            return $q->whereHas('order_items.stock', function ($q) {
                $q->where('imei', 'LIKE', '%' . request('imei') . '%');
            });
        })
        ->orderBy($sort, $by) // Order by variation name
        ->orderBy('orders.reference_id', 'desc') // Secondary order by reference_id

select * from `order_items` where `order_items`.`order_id` in (23281, 23282, 23283, 23285, 23286, 23287, 23288, 23289, 23290, 23291) and `order_items`.`deleted_at` is null
select * from `customer` where `customer`.`id` = 30438 and `customer`.`deleted_at` is null limit 1
---
            ->get();
            foreach($data['orders2'] as $order){

                $data2 = [
                    'order' => $order,
                    'customer' => $order->customer,
                    'orderItems' => $order->order_items,
                ];

select `orders`.`id`, `orders`.`reference_id`, `orders`.`customer_id`, SUM(order_items.price) as total_price, COUNT(order_items.id) as total_quantity, COUNT(CASE WHEN stock.status = 1 THEN order_items.id END) as available_stock, `orders`.`created_at` from `orders` inner join `order_items` on `orders`.`id` = `order_items`.`order_id` inner join `stock` on `order_items`.`stock_id` = `stock`.`id` where `orders`.`order_type_id` = 1 and `orders`.`deleted_at` is null group by `orders`.`id`, `orders`.`reference_id`, `orders`.`customer_id`, `orders`.`created_at` order by `orders`.`reference_id` desc limit 10 offset 0
---
            // ->onEachSide(5)
            // ->appends(request()->except('page'));

            $data['orders'] = Order_model::select(
                'orders.id',
                'orders.reference_id',
                'orders.customer_id',
                DB::raw('SUM(order_items.price) as total_price'),
                DB::raw('COUNT(order_items.id) as total_quantity'),
                DB::raw('COUNT(CASE WHEN stock.status = 1 THEN order_items.id END) as available_stock'),
                'orders.created_at')
            ->where('orders.order_type_id', 1)
            ->join('order_items', 'orders.id', '=', 'order_items.order_id')
            ->join('stock', 'order_items.stock_id', '=', 'stock.id')
            ->when(request('start_date'), function ($q) {
                return $q->where('orders.created_at', '>=', request('start_date'));
            })
            ->when(request('end_date'), function ($q) {
                return $q->where('orders.created_at', '<=', request('end_date') . " 23:59:59");
            })
            ->when(request('order_id'), function ($q) {
                return $q->where('orders.reference_id', 'LIKE', request('order_id') . '%');
            })
            ->groupBy('orders.id', 'orders.reference_id', 'orders.customer_id', 'orders.created_at')
            ->orderBy('orders.reference_id', 'desc') // Secondary order by reference_id
            ->paginate($per_page)
            ->onEachSide(5)
            ->appends(request()->except('page'));