app/Http/Livewire/Order.php

select * from `order_items` where `order_items`.`stock_id` in (5088, 5089, 5090, 5091, 5092, 5093, 5094, 5095, 5096, 5097, 5098, 5099, 5100, 5101) and `order_id` = '10' and `order_items`.`deleted_at` is null
---
        ->when(request('imei') != '', function ($q) {
            if(str_contains(request('imei'),' ')){
                $imei = explode(' ',request('imei'));
                return $q->whereHas('order_items.stock', function ($q) use ($imei) {
                    $q->whereIn('imei', $imei);
                });