app/Http/Livewire/Order.php

        $orders = Order_model::with(['customer','customer.orders','order_items','order_items.variation','order_items.variation.product', 'order_items.variation.grade_id', 'order_items.stock', 'order_items.replacement'])
        // ->where('orders.order_type_id',3)

        ->when(request('type') == '', function ($q) {
            return $q->where('orders.order_type_id',3);
        })
        ->when(request('items') == 1, function ($q) {
            return $q->whereHas('order_items', operator: '>', count: 1);
        })
---
select count(*) as aggregate from `orders` inner join `order_items` on `orders`.`id` = `order_items`.`order_id` inner join `variation` on `order_items`.`variation_id` = `variation`.`id` inner join `products` on `variation`.`product_id` = `products`.`id` where `orders`.`order_type_id` = 3 and `orders`.`deleted_at` is null

                });
            }
        })
        ->when(request('currency') != '', function ($q) {
            return $q->where('currency', request('currency'));
        })
        ->when(request('tracking_number') != '', function ($q) {
            if(strlen(request('tracking_number')) == 21){
                $tracking = substr(request('tracking_number'),1);
            }else{
                $tracking = request('tracking_number');
            }
            return $q->where('tracking_number', 'LIKE', '%' . $tracking . '%');
        })
        ->when(request('with_stock') == 2, function ($q) {
            return $q->whereHas('order_items', function ($q) {
                $q->where('stock_id', 0);
            });
        })
        ->when(request('with_stock') == 1, function ($q) {
            return $q->whereHas('order_items', function ($q) {
                $q->where('stock_id','>', 0);
            });
        })
---
select * from `order_items` where `order_items`.`stock_id` in (4282) and `order_id` = '4' and `order_items`.`deleted_at` is null
select * from `currency` where `currency`.`id` = 4 and `currency`.`id` is not null limit 1

        ->when(request('end_date') != '', function ($q) {
            if(request('adm') > 0){
                return $q->where('processed_at', '<=', request('end_date', 0) . " 23:59:59")->orderBy('processed_at','desc');
            }else{
                return $q->where('created_at', '<=', request('end_date', 0) . " 23:59:59");
            }
        })
        ->when(request('status') != '', function ($q) {
            return $q->where('status', request('status'));
        })
        ->when(request('adm') != '', function ($q) {
            if(request('adm') == 0){
                return $q->where('processed_by', null);
            }
            return $q->where('processed_by', request('adm'));
        })
        ->when(request('care') != '', function ($q) {
            return $q->whereHas('order_items', function ($query) {
                $query->where('care_id', '!=', null);
            });
        })
        ->when(request('order_id') != '', function ($q) {
            return $q->where('reference_id', 'LIKE', request('order_id') . '%');
        })
        ->when(request('sku') != '', function ($q) {
---
select * from `orders` where `orders`.`id` = '23288' and `orders`.`deleted_at` is null limit 1
select * from `order_items` where `order_items`.`order_id` in (23288) and `order_items`.`deleted_at` is null