app/Http/Livewire/Team.php

select * from `role` where `id` >= 1
select * from `permission`
---
    public function edit_member(Request $request,$id)
    {
        $data['user'] = session('user');
        $data['roles'] = Role_model::where('id','>=',$data['user']->role_id)->get();
        $data['parents'] = Admin_model::where('role_id','>=',$data['user']->role_id)->get();
        $data['permissions'] = Permission_model::all();

select `name` from `permission` inner join `role_permission` on `role_permission`.`permission_id` = `permission`.`id` where `role_permission`.`role_id` = 1
---
    public function get_permissions($roleId)
    {
        $role = Role_model::findOrFail($roleId);
        $permissions = $role->permissions()->pluck('name')->toArray();