app/Http/Livewire/Wholesale.php

select * from `stock` where `status` in (1, 3) and `stock`.`deleted_at` is null
---
    public function delete_order_item($item_id){

        $orderItem = Order_item_model::find($item_id);

        // Access the variation through orderItem->stock->variation
        $variation = $orderItem->stock->variation;

        $variation->stock += 1;
        $variation->save();

        // No variation record found or product_id and sku are both null, delete the order item

        // $orderItem->stock->delete();
        Stock_model::find($orderItem->stock_id)->update(['status'=>1]);

select `name`, `id` from `storage`
select * from `order_items` where `order_items`.`stock_id` in (2813, 2814) and `order_items`.`deleted_at` is null
select * from `stock` where `stock`.`variation_id` in (2317) and `stock`.`deleted_at` is null
select * from `orders` where `orders`.`id` = '20225' and `orders`.`deleted_at` is null limit 1
---
    public function wholesale_detail($order_id){

        $data['imeis'] = Stock_model::whereIn('status',[1,3])->get();
        $data['storages'] = Storage_model::pluck('name','id');
        $data['variations'] = Variation_model::whereHas('stocks.order_item', function($query) use ($order_id) {
            $query->where('order_id', $order_id);
        })
        ->with('stocks','stocks.order_item','stocks.variation')
        ->orderBy('grade','desc')
        ->get();

        $data['all_variations'] = Variation_model::where('grade',9)->get();
        $data['order'] = Order_model::find($order_id);

update `stock` set `status` = 2, `stock`.`updated_at` = '2024-04-15 17:02:11' where `id` = 2814
update `variation` set `stock` = 5, `variation`.`updated_at` = '2024-04-15 17:02:11' where `id` = 2317
insert into `order_items` (`order_id`, `variation_id`, `stock_id`, `quantity`, `price`, `status`, `updated_at`, `created_at`) values ('20225', 2317, 2814, 1, '215.00', 3, '2024-04-15 17:02:11', '2024-04-15 17:02:11')
---
    public function add_wholesale_item($order_id){

        if(ctype_digit(request('imei'))){
            $i = request('imei');
            $s = null;
        }else{
            $i = null;
            $s = request('imei');
        }

        $stock = Stock_model::where(['imei' => $i, 'serial_number' => $s])->first();
        $stock->status = 2;
        $stock->save();

        $variation = Variation_model::firstOrNew(['id' => $stock->variation_id]);
        $variation->stock -= 1;
        $variation->save();


        $order_item = new Order_item_model();
        $order_item->order_id = $order_id;
        $order_item->variation_id = $variation->id;
        $order_item->stock_id = $stock->id;
        $order_item->quantity = 1;
        $order_item->price = request('price');
        $order_item->status = 3;
        $order_item->save();