app/Models/Order_item_model.php

select * from `orders` where (`reference_id` = 39760814) and `orders`.`deleted_at` is null limit 1
---

                }
            }
            $orderItem->order_id = Order_model::where(['reference_id' => $orderObj->order_id])->first()->id;